БылковДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ИдентификацияАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИдентификацияАкадемическихЗадолженностей</name>
  <registerRecords>AccumulationRegister.НеудачныеПересдачи</registerRecords>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристика</name>
    <attributes>
      <name>Дисциплины</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПросроченныеЗадолженности Расход
	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристика Из Характеристика Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаХарактеристика.НомерСтроки;
	КонецЦикла;

	// регистр НеудачныеПересдачи Приход
	Движения.НеудачныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаХарактеристика Из Характеристика Цикл
		Движение = Движения.НеудачныеПересдачи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаХарактеристика.Дисциплины;
		Движение.КоличествоНеудачныхПересдач = ТекСтрокаХарактеристика.НомерСтроки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
